PANDAS TUTORIAL: python.pydata.org

In [ ]:
import pandas as pd
import numpy as np

OBJECT CREATION - SERIES DATA STRUCTURE

In [4]:
s = pd.Series([1,3,5,np.nan,5])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    5.0
dtype: float64

OBJECT CREATION - DATAFRAME DATA STRUCTURE

In [6]:
dates = pd.date_range('20190101', periods=6)

In [7]:
dates

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2019-01-01 -0.302738 -1.375862  2.200602  0.446272
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550

In [10]:
dct = dict()
dct = {'A': 1.,
'B': pd.Timestamp('20130102'),
'C': pd.Series(1, index=list(range(4)), dtype='float32'),
'D': np.array([3] * 4, dtype='int32'),
'E': pd.Categorical(["test", "train", "test", "train"]),
'F': 'foo'}

In [11]:
dct

{'A': 1.0, 'B': Timestamp('2013-01-02 00:00:00'), 'C': 0    1.0
 1    1.0
 2    1.0
 3    1.0
 dtype: float32, 'D': array([3, 3, 3, 3], dtype=int32), 'E': [test, train, test, train]
 Categories (2, object): [test, train], 'F': 'foo'}

In [12]:
df2 = pd.DataFrame(dct)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

VIEWING DATA

In [13]:
df.head()

                   A         B         C         D
2019-01-01 -0.302738 -1.375862  2.200602  0.446272
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079
2019-01-05 -1.702873  0.913274  0.898757  1.337476

In [14]:
df.tail()

                   A         B         C         D
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550

In [15]:
df.head(2)

                   A         B         C         D
2019-01-01 -0.302738 -1.375862  2.200602  0.446272
2019-01-02  0.497047  1.215860  1.404429  1.932641

In [16]:
df.tail(3)

                   A         B         C         D
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550

In [17]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
#df.to_numpy()
df2 = df.values

In [20]:
df2

array([[-0.30273817, -1.37586215,  2.200602  ,  0.44627218],
       [ 0.4970468 ,  1.21586017,  1.4044289 ,  1.93264142],
       [ 2.32346037, -0.61841056, -0.19710143, -0.58481209],
       [-1.30989039, -1.07002564, -1.16847545,  1.29007867],
       [-1.7028726 ,  0.91327382,  0.89875747,  1.33747588],
       [-1.47610917,  0.50196814, -0.37683235, -1.54355034]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.328517 -0.072199  0.460230  0.479684
std    1.541695  1.091189  1.256833  1.321467
min   -1.702873 -1.375862 -1.168475 -1.543550
25%   -1.434554 -0.957122 -0.331900 -0.327041
50%   -0.806314 -0.058221  0.350828  0.868175
75%    0.297101  0.810447  1.278011  1.325627
max    2.323460  1.215860  2.200602  1.932641

In [22]:
df.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A   -0.302738    0.497047    2.323460   -1.309890   -1.702873   -1.476109
B   -1.375862    1.215860   -0.618411   -1.070026    0.913274    0.501968
C    2.200602    1.404429   -0.197101   -1.168475    0.898757   -0.376832
D    0.446272    1.932641   -0.584812    1.290079    1.337476   -1.543550

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2019-01-01  0.446272  2.200602 -1.375862 -0.302738
2019-01-02  1.932641  1.404429  1.215860  0.497047
2019-01-03 -0.584812 -0.197101 -0.618411  2.323460
2019-01-04  1.290079 -1.168475 -1.070026 -1.309890
2019-01-05  1.337476  0.898757  0.913274 -1.702873
2019-01-06 -1.543550 -0.376832  0.501968 -1.476109

In [24]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-01 -0.302738 -1.375862  2.200602  0.446272

In [25]:
df.sort_values(by='C')

                   A         B         C         D
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-01 -0.302738 -1.375862  2.200602  0.446272

SELECTION

In [26]:
df['A']

2019-01-01   -0.302738
2019-01-02    0.497047
2019-01-03    2.323460
2019-01-04   -1.309890
2019-01-05   -1.702873
2019-01-06   -1.476109
Freq: D, Name: A, dtype: float64

In [27]:
df[0:2]

                   A         B         C         D
2019-01-01 -0.302738 -1.375862  2.200602  0.446272
2019-01-02  0.497047  1.215860  1.404429  1.932641

In [28]:
df.loc[dates[0]]

A   -0.302738
B   -1.375862
C    2.200602
D    0.446272
Name: 2019-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:, ['A','C']]

                   A         C
2019-01-01 -0.302738  2.200602
2019-01-02  0.497047  1.404429
2019-01-03  2.323460 -0.197101
2019-01-04 -1.309890 -1.168475
2019-01-05 -1.702873  0.898757
2019-01-06 -1.476109 -0.376832

In [30]:
df.iloc[3]

A   -1.309890
B   -1.070026
C   -1.168475
D    1.290079
Name: 2019-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[1:3, 0:2]

                   A         B
2019-01-02  0.497047  1.215860
2019-01-03  2.323460 -0.618411

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2019-01-02  0.497047  1.404429
2019-01-03  2.323460 -0.197101
2019-01-05 -1.702873  0.898757

BOOLEAN INDEXING

In [33]:
df[df.B > 0]

                   A         B         C         D
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550

In [34]:
df[df > 0]

                   A         B         C         D
2019-01-01       NaN       NaN  2.200602  0.446272
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-03  2.323460       NaN       NaN       NaN
2019-01-04       NaN       NaN       NaN  1.290079
2019-01-05       NaN  0.913274  0.898757  1.337476
2019-01-06       NaN  0.501968       NaN       NaN

In [35]:
df2 = df.copy()
df2['E'] = [1,1,1,1,1,1]
df2

                   A         B         C         D  E
2019-01-01 -0.302738 -1.375862  2.200602  0.446272  1
2019-01-02  0.497047  1.215860  1.404429  1.932641  1
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812  1
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079  1
2019-01-05 -1.702873  0.913274  0.898757  1.337476  1
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550  1

In [36]:
df2.at[dates[0],'E'] = 1.1
df2

                   A         B         C         D  E
2019-01-01 -0.302738 -1.375862  2.200602  0.446272  1
2019-01-02  0.497047  1.215860  1.404429  1.932641  1
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812  1
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079  1
2019-01-05 -1.702873  0.913274  0.898757  1.337476  1
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550  1

MISSING DATA

In [37]:
df2['E'] = [1,np.NaN,1,1,np.NaN,1]
df2

                   A         B         C         D    E
2019-01-01 -0.302738 -1.375862  2.200602  0.446272  1.0
2019-01-02  0.497047  1.215860  1.404429  1.932641  NaN
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812  1.0
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079  1.0
2019-01-05 -1.702873  0.913274  0.898757  1.337476  NaN
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550  1.0

In [38]:
df2.dropna(how='any')

                   A         B         C         D    E
2019-01-01 -0.302738 -1.375862  2.200602  0.446272  1.0
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812  1.0
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079  1.0
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550  1.0

In [39]:
df2.fillna(value=0.0)

                   A         B         C         D    E
2019-01-01 -0.302738 -1.375862  2.200602  0.446272  1.0
2019-01-02  0.497047  1.215860  1.404429  1.932641  0.0
2019-01-03  2.323460 -0.618411 -0.197101 -0.584812  1.0
2019-01-04 -1.309890 -1.070026 -1.168475  1.290079  1.0
2019-01-05 -1.702873  0.913274  0.898757  1.337476  0.0
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550  1.0

In [40]:
pd.isna(df2)

                A      B      C      D      E
2019-01-01  False  False  False  False  False
2019-01-02  False  False  False  False   True
2019-01-03  False  False  False  False  False
2019-01-04  False  False  False  False  False
2019-01-05  False  False  False  False   True
2019-01-06  False  False  False  False  False

OPERATIONS

In [41]:
df.mean()

A   -0.328517
B   -0.072199
C    0.460230
D    0.479684
dtype: float64

In [42]:
df2.mean()

A   -0.328517
B   -0.072199
C    0.460230
D    0.479684
E    1.000000
dtype: float64

In [43]:
df.mean(1)

2019-01-01    0.242068
2019-01-02    1.262494
2019-01-03    0.230784
2019-01-04   -0.564578
2019-01-05    0.361659
2019-01-06   -0.723631
Freq: D, dtype: float64

In [44]:
df.apply(np.cumsum)

                   A         B         C         D
2019-01-01 -0.302738 -1.375862  2.200602  0.446272
2019-01-02  0.194309 -0.160002  3.605031  2.378914
2019-01-03  2.517769 -0.778413  3.407929  1.794102
2019-01-04  1.207879 -1.848438  2.239454  3.084180
2019-01-05 -0.494994 -0.935164  3.138211  4.421656
2019-01-06 -1.971103 -0.433196  2.761379  2.878106

In [45]:
df2.apply(np.cumsum)

                   A         B         C         D    E
2019-01-01 -0.302738 -1.375862  2.200602  0.446272  1.0
2019-01-02  0.194309 -0.160002  3.605031  2.378914  NaN
2019-01-03  2.517769 -0.778413  3.407929  1.794102  2.0
2019-01-04  1.207879 -1.848438  2.239454  3.084180  3.0
2019-01-05 -0.494994 -0.935164  3.138211  4.421656  NaN
2019-01-06 -1.971103 -0.433196  2.761379  2.878106  4.0

In [46]:
df.apply(lambda x: x.max() - x.min())

A    4.026333
B    2.591722
C    3.369077
D    3.476192
dtype: float64

In [47]:
df2['E'].value_counts()

1.0    4
Name: E, dtype: int64

In [48]:
pieces = [df[0:2], df[4:6]]
pd.concat(pieces)

                   A         B         C         D
2019-01-01 -0.302738 -1.375862  2.200602  0.446272
2019-01-02  0.497047  1.215860  1.404429  1.932641
2019-01-05 -1.702873  0.913274  0.898757  1.337476
2019-01-06 -1.476109  0.501968 -0.376832 -1.543550

                ATTRIBUTES AND UNDERLYING DATA

In [50]:
df.shape

(6, 4)